[
{"eid": "1-s2.0-S0266613813002994", "doi": "10.1016/j.midw.2013.10.007", "pii": "S0266-6138(13)00299-4", "title": "Sources of information used by women during pregnancy to meet their information needs ", "publicationName": "Midwifery", "aggregationType": "Journal", "issn": "02666138", "volume": "30", "startingPage": "e26", "endingPage": "e33", "pageRange": "e26-e33", "coverDate": "2014-01-31", "author": "Heather A. Grimes, Della A. Forster, Michelle S. Newton;", "abstract": "Aim of the studyto explore the information sources used by women during pregnancy to meet their information needs regarding pregnancy, birth and the postpartum period.Designa cross-sectional postal survey of all eligible women who birthed at the Royal Women's Hospital, Melbourne, Australia between November 2010 and January 2011. Surveys were sent at four months post partum.Findingsforty-seven per cent (350/752) of eligible women returned the surveys, of whom 62% were primiparous. ‘Discussion with a midwife’ was the source of information used by the greatest number of women during pregnancy (246/350, 70%). Less than half of the women used the internet to access information (154/350, 44%), and group information sessions were the least preferred information format (8/330, 2.4%). Women from non-English speaking backgrounds (NESB) were less likely to use written and online resources. One-third of the women had unmet learning needs, particularly in relation to breast feeding and postnatal recovery. Overall, women rated books as the most useful source of information (57/332, 17.2%). The model of pregnancy care influenced the source women rated as most useful. Women who received most of their pregnancy care from a midwife described discussion with a midwife as their most useful source of information (42/150, 28%). In contrast, of the group who received most of their care from a doctor in antenatal clinic, the largest proportion reported that the internet was their most useful source of information (10/57, 28%).Conclusion and recommendationsdiscussion with midwives is an important source of information for women. The internet did not play a significant role in information seeking for more than half of the women in the study. Existing sources of information may not meet the needs of women from NESB, either because women do not access the multilingual resources currently available or because resources may only be provided in English or a few other common languages.", "openaccess": "0", "subject": "Information, Pregnancy, Internet, Information seeking;", "href": "https://www.sciencedirect.com/science/article/pii/S0266613813002994"}
]