[
{"id": "85006175043", "eid": "1-s2.0-S1471772716301154", "doi": "10.1016/j.infoandorg.2016.11.002", "pii": "S1471-7727(16)30115-4", "title": "Information: Fundamental positions and their implications for information systems research, education and practice ", "publicationName": "Information and Organization", "aggregationType": "Journal", "issn": "14717727", "volume": "27", "startingPage": "1", "endingPage": "16", "pageRange": "1-16", "coverDate": "2017-03-31", "author": "Sebastian K. Boell;", "abstract": "Information is an important concept for the “information age”, the “information society” and the discipline of Information Systems (IS). However, different conceptions of information often make incommensurable assumptions about what information is. This essay introduces a ‘consequential framework’ revealing different assumptions made about the nature of information and the consequences following from these assumptions. According to this consequential framework four stances on the existence of information can be distinguished: (1) A first stance assumes information to exist independently of humans as part of the physical world, for instance, in the structure of the universe or the transmission of signals; (2) a second stance assumes that information exists in signs but in a observer independent way, such as in objective facts about things; (3) a third stance assumes that information exists only in relation to a subject, so that the same document, report or data will convey different information to different individuals; (4) a fourth stance assumes information to exist within a sociocultural setting, as lawyers, doctors or accountants differ in what is information to them. Each of these four stances makes vastly different assumptions about how information can be accessed and used by humans. This has further consequences for how information can be researched and how related concepts, such as data, signs, technology, or social context can be related to the study of information. The consequential framework introduced offers conceptual clarity regarding a central but largely ignored concept for IS and its reference disciplines.", "openaccess": "0", "subject": "Information, Framework, Information Systems, Theorizing information, Conceptualizing information, Literature review, Objective, Subjective;", "href": "https://www.sciencedirect.com/science/article/pii/S1471772716301154"}
]