[
{"eid": "1-s2.0-S2214212617300972", "doi": "10.1016/j.jisa.2017.07.004", "pii": "S2214-2126(17)30097-2", "title": "Integrating information quality dimensions into information security risk management (ISRM) ", "publicationName": "Journal of Information Security and Applications", "aggregationType": "Journal", "issn": "22142126", "volume": "36", "startingPage": "1", "endingPage": "10", "pageRange": "1-10", "coverDate": "2017-10-31", "author": "Palaniappan Shamala, Rabiah Ahmad, Ali Zolait, Muliati Sedek;", "abstract": "Information security is becoming an important entity to most organizations due to current trends in information transfer through a borderless and vulnerable world. This gives more concerns and aware organization to apply information security risk management (ISRM) to develop effective and economically-viable control strategies. Even though there are numerous ISRM methods that are readily available, most of the ISRM methods prescribe a similar process that leads to establish a scope of the assessment, collecting information, producing intermediary information, and finally using the collected information to identify their security risks and provide a measured, analyzed security profile of critical information assets. Based on the “garbage in-garbage out” phenomenon, the success of ISRM planning tremendously depends on the quality of input information. However, with the amount, diversity and variety of information available, practitioners can easily deflects with grown information and becoming unmanageable. Therefore this paper contribute as a stepping stone to determine which IQ dimensions constitute the quality of the information throughout the process of gathering information during ISRM. Seems to accurately define the attributes of IQ dimensions, IQ needs to be assessed within the context of its generation. Thus, papers on IQ web were assessed and comparative analysis was conducted to identify the possible dimensions for ISRM. Then, online survey using likert structured questionnaire were distributed among a group of information security practitioners in Malaysia (N = 150). Partial least square (PLS) analysis revealed that dimension accuracy, amount of data, objective, completeness, reliability and verifiability are significantly influence the quality of information gathering for ISRM. These IQ dimensions can guide practitioners in the process of gathering quality and complete information in order to make a plan that leads to a clear direction, and ultimately help to make decisions that lead to success.", "openaccess": "0", "subject": "Information security, Risk management, Information quality, Information Security Risk Management;", "href": "https://www.sciencedirect.com/science/article/pii/S2214212617300972"}
]